Revit 2027 API
AnalyticalPowerSourceData.ApparentPowerRating Property
 The apparent power rating value of the analytical power source.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApparentPowerRating { get; set; }
Public Property ApparentPowerRating As Double
	Get
	Set
public:
property double ApparentPowerRating {
	double get ();
	void set (double value);
}
member ApparentPowerRating : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for rating is not a number -or- When setting this property: The given value for rating is not finite
ArgumentOutOfRangeException |  When setting this property: The given value for rating must be non-negative.
See Also
Reference
AnalyticalPowerSourceData Class
Autodesk.Revit.DB.Electrical Namespace